from collections import defaultdict

# Исходный список цветов
abajur_colors_dict = {
    "шампанское": ["Шампанское"],
    "золото": ["Золото/зеленый", "Золото/Белый", "Золото с серебром", "Золото/Коричневый", "золотое шампанское", "золото/коричневый", "Золото/разноцветный", "Золото/Белый/Чёрный", "Золото/Бирюза", "Золото/Синий", "золото/прозрачный", "Золото/Латунь", "Золото/Зелёный", "Золото/Белый/Черный", "Золото/Краcный", "Золото/Янтарный", "Золото/Серый", "Золото/Матовый Черный", "золото/прозрачный", "Золото/Чёрный", "Золото/Черный", "золото/белый", "золото/зеленый"],
    "зеленый": ["Золото/зеленый", "Зеленый/Латунь", "Зеленый/белый/дерево", "Зеленый/белый", "Зеленый (градиент)", "зеленый/золотой", "золотой/зеленый/черный", "Золото/Зелёный", "Зеленый", "зеленый", "Зелёный"],
    "черный": ["Жемчужно-черный", "золотой/черный", "Черный/хром", "Чёрный/Латунь", "античная бронза/черный", "Чёрный", "черный/бронзовый", "Черный/серый", "черный/золотистый", "Черная бронза", "черный/бронза", "черный/матовое золото", "Черный/белый", "Черный/белый/красный", "Черный/Хром", "черный/дерево", "Черный/Золотой", "черный/прозрачный", "черный/античная бронза", "черный/античная латунь", "черный/светлое дерево", "Черный/дымчатый", "Черный/золото/белый", "черный/золотой", "черный/серебро", "черный/золотая патина", "Черный/Золото", "черный/белый", "черный/золото", "Черный/Белый/Серый", "черный/золотистый", "черный/латунь", "черный/коричневый", "Черный/Серый/Белый", "черный/серый", "Черный/бронза", "Черный/медный/прозрачный", "черный/брашировання бронза", "черный/кварцевый", "черный/анодированный золотой", "черный/металл", "черный/под дерево", "черный/шампань", "черный/медный", "Черный/Кофейный/Золото", "Черный/Дерево", "Черный с Золотом", "Черный/лава", "Черный/Дымчатый", "Черный/Латунь", "черный"],
    "сиреневый": ["сиреневый"],
    "латунь": ["латунь/черный", "Латунь/Золото", "латунь", "Латунь", "латунь/прозрачный", "Латунь/Красный", "латунь/белый", "латунь титаниум", "латунный", "Латунь/Черный", "Латунь матовый", "античная латунь/черный", "Латунь/Зелёный"],
    "золотой": ["золотой матовый", "золотой/черный", "золотой/зеленый", "золотой/серый", "золотой/белый", "золото с серебряной патиной/прозрачный", "Золотой/Прозрачный", "золотой/коричневый", "Золотой", "золотой"],
    "терракотовый": ["терракотовый", "терракота"],
    "белое": ["Белое золото патинированное", "белое золото", "белый жемчужный"],
    "слоновая кость": ["слоновая кость", "Слоновая кость/Хром"],
    "серебро": ["серебро/черный", "серебро", "Серебро", "серебристый", "Серебристый", "серебряная фольга", "Серебряный", "Серебро/Золото"],
    "светлое": ["Светлое дерево"],
    "голубой": ["Голубой", "Голубой/белый/дерево"],
    "оранжевый": ["Оранжевый", "оранжевый"],
    "белый": ["Золото/Белый", "Белый/Матовый", "Белый/Хром", "белый/серый", "Белый/хром", "белый/медный", "белый/никель", "белый/светлое дерево", "Белый/Серебро", "белый/розовый", "белый/золотистый", "белый/алюминиевый", "белый/прозрачный", "Белый/Чёрный", "Белый/Черный", "Белый/черный", "белый/черный/матовое золото", "Белый/Латунь", "Белый/Серый/Черный", "белый/черный/синий", "Белый/Черный/Серый", "Белый/Бежевый", "белый/бежевый", "Белый/дерево", "Белый/серебро", "Белый/золото", "Белый/золотой", "белый/голубой", "Белый/под дерево", "Белый с Серебром", "Белый с Золотом", "Белый"],
    "серый": ["светло-серый", "серый/хром", "серый/бежевый", "Серый/Белый", "серый/дерево", "темно-серый", "серый", "Серый", "хром/серый", "Серый/белый/дерево", "Серый/Черный", "Серый/Белый/Черный", "Серый/Бежевый", "Серый/Дерево", "Темно-серый"],
    "античная": ["античная бронза/черный", "античная бронзовый", "античное золото/черный", "античное золото/матовый черный"],
    "хром": ["Черный/хром", "хром/серый", "Хром", "хром", "Хром/Золото/Прозрачный", "Хром/прозрачный", "Хром/Дымчатый", "Хром/Белый", "Хром/Чёрный", "Хром/дымчатый", "Хром/Бирюзовый", "Хром/Латунь", "Хром/Золото", "Хром/Матовый", "Хром/Прозрачный", "Хром/белый", "хром/золотой", "Хром/черный"],
    "бронза": ["Бронза/Матовый Черный", "бронза", "Бронза", "бронза светлая/черный", "Бронза/Чёрный", "Бронза/белый", "Бронза/Матовый Белый", "античная бронза/металл", "Бронза Антик"],
    "медь": ["медь", "Медь", "Медь черненая", "медный", "Медный", "медный/черный", "Медно-черный", "Медный цвет", "Медный цвет/Цвет мрамора"],
    "никель": ["никель", "Никель", "никель/античная бронза", "матовый никель", "никель/белый", "никель/хром"],
    "розовый": ["розовый", "Розовый", "Розовое золото", "Розовое Золото", "Розовый/белый", "Розовый/белый/дерево", "Розовый хром"],
    "бежевый": ["бежевый", "Бежевый", "бежевый/черный", "Бежевый и серый"],
    "коричневый": ["Коричневый топаз", "коричневый", "Коричневый", "Коричневый с эффектом ржавчины", "коричневый/латунь", "коричневый/бежевый/белый", "Коричневый/золото", "коричневый/черный", "Коричневый/Чёрный"],
    "дерево": ["Дерево", "дерево", "черный/дерево", "Черный/Дерево", "Дерево/белый", "Дерево/черный", "белый/дерево"],
    "оливковый": ["оливковый", "оливковый/латунь"],
    "алюминий": ["алюминий", "Алюминий", "Алюминий Хром"],
    "мрамор": ["белый мрамор", "Цвет мрамора"],
    "жемчужный": ["Жемчужно-черный", "Жемчужный черный"],
    "светлый": ["светло-коричневый"],
    "желтый": ["Желтый", "желтый", "Желтый/белый/дерево"],
    "бирюза": ["Золото/Бирюза", "Бирюза"],
    "графит": ["Графит"],
    "титан": ["Титан"],
    "кофе": ["кофе", "кофе/золотой", "Кофейный"],
    "кремовый": ["Кремовый", "Кремовый с Золотом"],
    "лайм": ["Лайм золото"],
    "матовый": ["матовый", "Матовый", "Матовый хром", "матовый никель", "матовый никель/белый", "Матовый Белый", "Матовый Черный", "Матовый Черный/Матовый Белый", "Матовый Черный/Бронза", "Матовое золото", "Матовое\xa0Золото", "Матовый\xa0Черный", "Матовый Белый/Матовый Черный", "Матовый Черный/Матовое золото", "Матовое Золото", "Матовая латунь", "Матовое серебро", "Матовый дымчатый"],
    "патина": ["Белое золото патинированное", "накладной светильник/каркас коричневого цвета с патиной", "золото с серебряной патиной/прозрачный", "Серебро с патиной"],
    "разноцветный": ["разноцветный", "Разноцветный"],
    "прозрачный": ["Прозрачный", "прозрачный", "Никель/Прозрачный", "Хром/Прозрачный", "бронзовый/Прозрачный"],
    "красный": ["Красный", "красный", "Красное золото", "Красный/черный", "Красный/белый", "Красный/Матовый", "Золото/красный", "бордовый", "бордовый/черный", "Марсала"],
    "французский": ["французское золото/серый", "Французское золото"],
    "венге": ["венге"],
    "античный": ["античный бронзовый", "Античная бронза", "античная латунь"],
    "светлое дерево": ["светлое дерево"],
    "брашированный": ["брашированный бронзовый", "черный брашированный", "бронзовый брашинг"],
    "состаренный": ["Состаренное золото"],
    "леопардовый": ["леопардовый"],
    "мятный": ["мятный зеленый"],
    "песочный": ["Песочно-черный", "Матовая латунь+песочный черный"],
    "умбра": ["Умбра"],
    "фиолетовый": ["фиолетовый", "Фиолетовый"],
    "хаки": ["хаки", "Хаки"],
    "цвет": ["Медный цвет"],
    "шампань": ["шампань", "Шампань"],
    "янтарный": ["Янтарный"],
    "кортен": ["кортен"],
    "травертин": ["травертиновый", "камень травертин"],
    "молочный": ["Молочный", "молочный"],
    "полированный": ["полированное золото", "полированный хром"],
    "тёмно-зелёный": ["Темно-зеленый"],
    "тёмно-синий": ["Темно-синий", "Темно-сине-зеленый"],
    "тёмно-коричневый": ["Темно-коричневый", "темно-коричневый"],
    "тёмное дерево": ["Темное дерево", "темное дерево"],
    "тёмное золото": ["Темное золото"],
    "светлый лен": ["Светлый лен"],
    "серо-голубой": ["Серо-голубой"],
    "бордовый": ["бордовый/бежевый"],
    "мокко": ["мокко"],
    "перламутровый": ["перламутровый", "Перламутровый"],
    "дымчатый": ["Дымчатый", "дымчатый/серый", "дымчатый/латунь"],
    "зеркальный": ["Зеркальное золото"],
    "антрацит": ["Антрацит"],
    "платина": ["Платина"],
    "рубиновый": ["Рубиновый"],
    "смоки": ["смоки"]
}
for color_key, variants in list(abajur_colors_dict.items()):
    for variant in list(variants):
        # только комбинированные варианты нас интересуют
        if "/" not in variant:
            continue

        parts = [p.strip().lower() for p in variant.split("/")]
        for part in parts:
            # ищем ключ, совпадающий с частью
            for target_key in abajur_colors_dict:
                for nvariant in abajur_colors_dict[target_key]:
                        
                        if nvariant == part:
                            #print(variant, nvariant)
                            abajur_colors_dict[target_key].append(variant)
                            
                            # не ищем дальше для этой части
                            break

# Убираем дубликаты и сортируем каждое значение
for key, variants in abajur_colors_dict.items():
    abajur_colors_dict[key] = sorted(set(variants), key=lambda s: s.lower())

# Красиво выводим результат
import json
print(
    json.dumps(
        abajur_colors_dict,
        ensure_ascii=False,
        indent=2,
        sort_keys=True  # вот он — сортировка ключей
    )
)